In [1]:
!rm -f Chinook.zip
!rm -f *.csv

zsh:1: no matches found: *.csv

In [9]:
import sys
print(sys.executable)

/Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/bin/python

In [12]:
import sys
py = sys.executable
!"{py}" -m pip install --upgrade pip
!"{py}" -m pip install pandas sqlalchemy mysql-connector-python nbformat nbconvert

Requirement already satisfied: pip in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (25.2)
Collecting pip
  Using cached pip-25.3-py3-none-any.whl.metadata (4.7 kB)
Using cached pip-25.3-py3-none-any.whl (1.8 MB)
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 25.2
    Uninstalling pip-25.2:
      Successfully uninstalled pip-25.2
Successfully installed pip-25.3
Collecting pandas
  Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (91 kB)
Collecting sqlalchemy
  Using cached sqlalchemy-2.0.45-py3-none-any.whl.metadata (9.5 kB)
Collecting mysql-connector-python
  Using cached mysql_connector_python-9.5.0-cp313-cp313-macosx_14_0_arm64.whl.metadata (7.5 kB)
Requirement already satisfied: nbformat in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (5.10.4)
Requirement already satisfied: nbconvert in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (7.16.6)
Requirement already satisfied: numpy>=1.26.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.1)
Requirement already satisfied: fastjsonschema>=2.15 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (2.21.1)
Requirement already satisfied: jsonschema>=2.6 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (4.25.0)
Requirement already satisfied: jupyter-core!=5.0.*,>=4.12 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (5.8.1)
Requirement already satisfied: traitlets>=5.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (5.14.3)
Requirement already satisfied: beautifulsoup4 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (4.13.4)
Requirement already satisfied: bleach!=5.0.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from bleach[css]!=5.0.0->nbconvert) (6.2.0)
Requirement already satisfied: defusedxml in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (0.7.1)
Requirement already satisfied: jinja2>=3.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (3.1.6)
Requirement already satisfied: jupyterlab-pygments in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (0.3.0)
Requirement already satisfied: markupsafe>=2.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (3.0.2)
Requirement already satisfied: mistune<4,>=2.0.3 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (3.1.3)
Requirement already satisfied: nbclient>=0.5.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (0.10.2)
Requirement already satisfied: packaging in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (25.0)
Requirement already satisfied: pandocfilters>=1.4.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (1.5.1)
Requirement already satisfied: pygments>=2.4.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (2.19.2)
Requirement already satisfied: webencodings in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from bleach!=5.0.0->bleach[css]!=5.0.0->nbconvert) (0.5.1)
Requirement already satisfied: tinycss2<1.5,>=1.1.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from bleach[css]!=5.0.0->nbconvert) (1.4.0)
Requirement already satisfied: attrs>=22.2.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (25.3.0)
Requirement already satisfied: jsonschema-specifications>=2023.03.6 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (2025.4.1)
Requirement already satisfied: referencing>=0.28.4 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (0.36.2)
Requirement already satisfied: rpds-py>=0.7.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (0.26.0)
Requirement already satisfied: platformdirs>=2.5 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jupyter-core!=5.0.*,>=4.12->nbformat) (4.3.8)
Requirement already satisfied: jupyter-client>=6.1.12 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbclient>=0.5.0->nbconvert) (8.6.3)
Requirement already satisfied: pyzmq>=23.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jupyter-client>=6.1.12->nbclient>=0.5.0->nbconvert) (27.0.0)
Requirement already satisfied: tornado>=6.2 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jupyter-client>=6.1.12->nbclient>=0.5.0->nbconvert) (6.5.1)
Requirement already satisfied: six>=1.5 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: soupsieve>1.2 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from beautifulsoup4->nbconvert) (2.7)
Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl (10.7 MB)
Using cached sqlalchemy-2.0.45-py3-none-any.whl (1.9 MB)
Using cached mysql_connector_python-9.5.0-cp313-cp313-macosx_14_0_arm64.whl (17.6 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: pytz, tzdata, sqlalchemy, mysql-connector-python, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 5/5 [pandas]━━━━ 4/5 [pandas]onnector-python]
Successfully installed mysql-connector-python-9.5.0 pandas-2.3.3 pytz-2025.2 sqlalchemy-2.0.45 tzdata-2025.3

In [13]:
ls

Album.csv          Chinook.zip        Invoice.csv        Playlist.csv
answers.zip        Customer.csv       InvoiceLine.csv    PlaylistTrack.csv
Artist.csv         Employee.csv       MediaType.csv      README.md
autograder.py      Genre.csv          p1.ipynb           Track.csv

In [14]:
!wget -O Chinook.zip https://github.com/CS639-Data-Management-for-Data-Science/s25/raw/main/p1/Chinook.zip
!unzip -o Chinook.zip
!ls -la

--2026-01-03 22:22:04--  https://github.com/CS639-Data-Management-for-Data-Science/s25/raw/main/p1/Chinook.zip
Resolving github.com (github.com)... 20.207.73.82
Connecting to github.com (github.com)|20.207.73.82|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/CS639-Data-Management-for-Data-Science/s25/main/p1/Chinook.zip [following]
--2026-01-03 22:22:04--  https://raw.githubusercontent.com/CS639-Data-Management-for-Data-Science/s25/main/p1/Chinook.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.109.133, 185.199.110.133, 185.199.108.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.109.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 146381 (143K) [application/zip]
Saving to: ‘Chinook.zip’

Chinook.zip         100%[===================>] 142.95K  --.-KB/s    in 0.1s

2026-01-03 22:22:05 (1.21 MB/s) - ‘Chinook.zip’ saved [146381/146381]

Archive:  Chinook.zip
  inflating: Album.csv
  inflating: Artist.csv
  inflating: Customer.csv
  inflating: Employee.csv
  inflating: Genre.csv
  inflating: Invoice.csv
  inflating: InvoiceLine.csv
  inflating: MediaType.csv
  inflating: Playlist.csv
  inflating: PlaylistTrack.csv
  inflating: Track.csv
total 1560
drwxr-xr-x@ 20 saifyfairozkhan  staff     640 Jan  3 22:22 .
drwxr-xr-x@  4 saifyfairozkhan  staff     128 Jan  3 20:15 ..
drwxr-xr-x@  3 saifyfairozkhan  staff      96 Jan  3 22:10 .ipynb_checkpoints
drwxr-xr-x@  9 saifyfairozkhan  staff     288 Jan  3 22:09 .venv
-rw-r--r--@  1 saifyfairozkhan  staff   10816 Sep 19  2024 Album.csv
-rw-r--r--@  1 saifyfairozkhan  staff  127504 Jan  3 20:15 answers.zip
-rw-r--r--@  1 saifyfairozkhan  staff    7016 Sep 19  2024 Artist.csv
-rw-r--r--@  1 saifyfairozkhan  staff    6193 Jan  3 20:15 autograder.py
-rw-r--r--@  1 saifyfairozkhan  staff  146381 Jan  3 22:22 Chinook.zip
-rw-r--r--@  1 saifyfairozkhan  staff    6737 Sep 19  2024 Customer.csv
-rw-r--r--@  1 saifyfairozkhan  staff    1392 Sep 19  2024 Employee.csv
-rw-r--r--@  1 saifyfairozkhan  staff     328 Sep 19  2024 Genre.csv
-rw-r--r--@  1 saifyfairozkhan  staff   27882 Sep 19  2024 Invoice.csv
-rw-r--r--@  1 saifyfairozkhan  staff   44673 Sep 19  2024 InvoiceLine.csv
-rw-r--r--@  1 saifyfairozkhan  staff     136 Sep 19  2024 MediaType.csv
-rw-r--r--@  1 saifyfairozkhan  staff   11892 Jan  3 22:20 p1.ipynb
-rw-r--r--@  1 saifyfairozkhan  staff     298 Sep 19  2024 Playlist.csv
-rw-r--r--@  1 saifyfairozkhan  staff   58707 Sep 19  2024 PlaylistTrack.csv
-rw-r--r--@  1 saifyfairozkhan  staff   20808 Jan  3 20:15 README.md
-rw-r--r--@  1 saifyfairozkhan  staff  241798 Sep 19  2024 Track.csv

In [15]:
import os
import pandas as pd
import pickle
from sqlalchemy import create_engine, text

In [16]:
engine = create_engine("mysql+mysqlconnector://root:123456@127.0.0.1:3306/Chinook")
conn = engine.connect()

In [17]:
csvs = [f for f in os.listdir(".") if f.endswith(".csv")]

for f in csvs:
    table = f.replace(".csv", "")   # table name must match the csv file name
    df = pd.read_csv(f)
    df.to_sql(table, con=engine, if_exists="replace", index=False)

print("Loaded tables:", len(csvs))

Loaded tables: 11

In [20]:
#q1
sql = """
SELECT *
FROM Artist
WHERE Name = 'Queen';
"""
q1_df = pd.read_sql(sql, conn)
q1_df.to_pickle("q1.pkl")
q1_df

   ArtistId   Name
0        51  Queen

In [21]:
#q2
sql = """
SELECT *
FROM Album
WHERE ArtistId = (
    SELECT ArtistId
    FROM Artist
    WHERE Name = 'Queen'
);
"""
q2_df = pd.read_sql(sql, conn)
q2_df.to_pickle("q2.pkl")
q2_df.head()

   AlbumId              Title  ArtistId
0       36   Greatest Hits II        51
1      185    Greatest Hits I        51
2      186  News Of The World        51

In [22]:
#q3
sql = """
SELECT *
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (
        SELECT ArtistId
        FROM Artist
        WHERE Name = 'Queen'
    )
);
"""
q3_df = pd.read_sql(sql, conn)
q3_df.to_pickle("q3.pkl")
q3_df.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,419,A Kind Of Magic,36,1,1,Roger Taylor,262608,8689618,0.99
1,420,Under Pressure,36,1,1,Queen & David Bowie,236617,7739042,0.99
2,421,Radio GA GA,36,1,1,Roger Taylor,343745,11358573,0.99
3,422,I Want It All,36,1,1,Queen,241684,7876564,0.99
4,423,I Want To Break Free,36,1,1,John Deacon,259108,8552861,0.99

In [23]:
q3_df.shape

(45, 9)

In [24]:
q3_df[["TrackId","Name","Composer","Milliseconds","Bytes"]].head()

   TrackId                  Name             Composer  Milliseconds     Bytes
0      419       A Kind Of Magic         Roger Taylor        262608   8689618
1      420        Under Pressure  Queen & David Bowie        236617   7739042
2      421           Radio GA GA         Roger Taylor        343745  11358573
3      422         I Want It All                Queen        241684   7876564
4      423  I Want To Break Free          John Deacon        259108   8552861

In [27]:
#q4
sql = """
SELECT COUNT(*) AS TotalQueenTracks
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
AND Composer LIKE '%Queen%';
"""
q4_df = pd.read_sql(sql, conn)
q4_df.to_pickle("q4.pkl")
q4_df

   TotalQueenTracks
0                10

In [28]:
#q5
sql = """
SELECT DISTINCT Composer
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
AND Composer IS NOT NULL
ORDER BY Composer;
"""
q5_df = pd.read_sql(sql, conn)
q5_df.to_pickle("q5.pkl")
q5_df.head(20)

                         Composer
0                       Brian May
1                          Deacon
2                    Deacon, John
3         Deacon, John/May, Brian
4                 Freddie Mercury
5   Freddie Mercury & John Deacon
6                     John Deacon
7                             May
8                      May, Brian
9                         Mercury
10               Mercury, Freddie
11                          Queen
12            Queen & David Bowie
13                   Roger Taylor
14                         Taylor

In [29]:
#q6
sql = """
SELECT *
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
ORDER BY Milliseconds DESC
LIMIT 5;
"""
q6_df = pd.read_sql(sql, conn)
q6_df.to_pickle("q6.pkl")
q6_df[["TrackId","Name","Milliseconds","Bytes"]]

   TrackId                       Name  Milliseconds     Bytes
0      424                   Innuendo        387761  12664591
1     2280                  It's Late        386194  12519388
2     2254          Bohemian Rhapsody        358948  11619868
3      421                Radio GA GA        343745  11358573
4      427  Who Wants To Live Forever        297691   9577577

In [30]:
#q7
sql = """
SELECT *
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
AND Bytes < 6000000
ORDER BY Bytes ASC;
"""
q7_df = pd.read_sql(sql, conn)
q7_df.to_pickle("q7.pkl")
q7_df[["TrackId","Name","Bytes"]].head()

   TrackId                            Name    Bytes
0     2271                We Will Rock You  4026815
1     2269                We Will Rock You  4026955
2     2262  Crazy Little Thing Called Love  5435501
3     2267                           Flash  5464986
4     2268              Seven Seas Of Rhye  5539957

In [31]:
#q8
sql = """
SELECT
    Name,
    (Milliseconds / 60000.0) AS DurationMinutes,
    (Bytes / 1000000.0) AS `FileSize in MB`
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
ORDER BY Name;
"""
q8_df = pd.read_sql(sql, conn)
q8_df.to_pickle("q8.pkl")
q8_df.head()

                         Name  DurationMinutes  FileSize in MB
0             A Kind Of Magic           4.3768          8.6896
1          All Dead, All Dead           3.1687          6.1449
2  Another One Bites The Dust           3.6158          7.1724
3                Bicycle Race           3.0637          6.0124
4           Bohemian Rhapsody           5.9825         11.6199

In [32]:
import os
[os.path.exists(f"q{i}.pkl") for i in range(1,9)]

[True, True, True, True, True, True, True, True]

In [33]:
#q9
sql = """
SELECT CustomerId, FirstName, LastName, State
FROM Customer
WHERE Country = 'USA'
ORDER BY State ASC;
"""
q9_df = pd.read_sql(sql, conn)
q9_df.to_pickle("q9.pkl")
q9_df.head()

   CustomerId FirstName LastName State
0          27   Patrick     Gray    AZ
1          16     Frank   Harris    CA
2          19       Tim    Goyer    CA
3          20       Dan   Miller    CA
4          22   Heather  Leacock    FL

In [34]:
#q10
sql = """
SELECT *
FROM Invoice
WHERE Total > 20
ORDER BY Total DESC, InvoiceId ASC;
"""
q10_df = pd.read_sql(sql, conn)
q10_df.to_pickle("q10.pkl")
q10_df.head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,404,6,2025-11-13,Rilská 3174/6,Prague,None,Czech Republic,14300,25.86
1,299,26,2024-08-05,2211 W Berry Street,Fort Worth,TX,USA,76110,23.86
2,96,45,2022-02-18,Erzsébet krt. 58.,Budapest,None,Hungary,H-1073,21.86
3,194,46,2023-04-28,3 Chatham Street,Dublin,Dublin,Ireland,None,21.86

In [35]:
#q11
sql = """
SELECT *
FROM Invoice
WHERE YEAR(InvoiceDate) = 2021
ORDER BY InvoiceDate ASC, InvoiceId ASC;
"""
q11_df = pd.read_sql(sql, conn)
q11_df.to_pickle("q11.pkl")
q11_df.head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2021-01-01,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2021-01-02,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2021-01-03,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2021-01-06,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2021-01-11,69 Salem Street,Boston,MA,USA,2113,13.86

In [36]:
#q12
sql = """
SELECT SUM(Total) AS TotalExpenditure
FROM Invoice
WHERE CustomerId = (
    SELECT CustomerId
    FROM Customer
    WHERE FirstName = 'Eduardo' AND LastName = 'Martins'
);
"""
q12_df = pd.read_sql(sql, conn)
q12_df.to_pickle("q12.pkl")
q12_df

   TotalExpenditure
0             37.62

In [37]:
#q13
sql = """
SELECT *
FROM Customer
WHERE Country = 'USA'
  AND (Company IS NULL OR Company = '')
ORDER BY CustomerId ASC;
"""
q13_df = pd.read_sql(sql, conn)
q13_df.to_pickle("q13.pkl")
q13_df.head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,18,Michelle,Brooks,None,627 Broadway,New York,NY,USA,10012-2612,+1 (212) 221-3546,+1 (212) 221-4679,michelleb@aol.com,3
1,20,Dan,Miller,None,541 Del Medio Avenue,Mountain View,CA,USA,94040-111,+1 (650) 644-3358,None,dmiller@comcast.com,4
2,21,Kathy,Chase,None,801 W 4th Street,Reno,NV,USA,89503,+1 (775) 223-7665,None,kachase@hotmail.com,5
3,22,Heather,Leacock,None,120 S Orange Ave,Orlando,FL,USA,32801,+1 (407) 999-7788,None,hleacock@gmail.com,4
4,23,John,Gordon,None,69 Salem Street,Boston,MA,USA,2113,+1 (617) 522-1333,None,johngordon22@yahoo.com,4

In [38]:
#q14
sql = """
SELECT *
FROM Employee
WHERE Country = 'Canada'
ORDER BY EmployeeId ASC;
"""
q14_df = pd.read_sql(sql, conn)
q14_df.to_pickle("q14.pkl")
q14_df

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18,2002-08-14,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08,2002-05-01,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29,2002-04-01,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19,2003-05-03,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03,2003-10-17,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01,2003-10-17,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29,2004-01-02,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09,2004-03-04,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

In [39]:
import os
missing = [i for i in range(1, 15) if not os.path.exists(f"q{i}.pkl")]
missing

[]